In [2]:
import pandas as pd
import numpy as np

In [3]:
# here we create a simple dataframe
raw_data = {'first_name': ['Noureddin', 'Josef', 'Mike', 'Ali', 'Luke'],
        'last_name': ['Sadawi', 'Baker', 'Brooks', 'Shah', 'Brown'],
        'year': [2015,2009,2013,2016,2014],
        'score': [422,322,233,223,401]}
df = pd.DataFrame(raw_data, index = ['Tripoli', 'Birmingham', 'London', 'Islamabad', 'New York'])
df

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    422  2015
Birmingham      Josef     Baker    322  2009
London           Mike    Brooks    233  2013
Islamabad         Ali      Shah    223  2016
New York         Luke     Brown    401  2014

In [4]:
m = df[df < 240]

In [15]:
# m is a dataframe that contains missing values ,, the NaNs
m

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    1.0   1.0
Birmingham      Josef     Baker    1.0   1.0
London           Mike    Brooks  233.0   1.0
Islamabad         Ali      Shah  223.0   1.0
New York         Luke     Brown    1.0   1.0

In [6]:
m.dropna

<bound method DataFrame.dropna of            first_name last_name  score  year
Tripoli     Noureddin    Sadawi    NaN   NaN
Birmingham      Josef     Baker    NaN   NaN
London           Mike    Brooks  233.0   NaN
Islamabad         Ali      Shah  223.0   NaN
New York         Luke     Brown    NaN   NaN>

In [8]:
m.dropna(how='all')

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    NaN   NaN
Birmingham      Josef     Baker    NaN   NaN
London           Mike    Brooks  233.0   NaN
Islamabad         Ali      Shah  223.0   NaN
New York         Luke     Brown    NaN   NaN

In [9]:
m.dropna(how='all',axis=1)

           first_name last_name  score
Tripoli     Noureddin    Sadawi    NaN
Birmingham      Josef     Baker    NaN
London           Mike    Brooks  233.0
Islamabad         Ali      Shah  223.0
New York         Luke     Brown    NaN

In [10]:
m.dropna(how='all',axis=1,thresh=3)

           first_name last_name
Tripoli     Noureddin    Sadawi
Birmingham      Josef     Baker
London           Mike    Brooks
Islamabad         Ali      Shah
New York         Luke     Brown

In [12]:
m.fillna(1)

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    1.0   1.0
Birmingham      Josef     Baker    1.0   1.0
London           Mike    Brooks  233.0   1.0
Islamabad         Ali      Shah  223.0   1.0
New York         Luke     Brown    1.0   1.0

In [13]:
m.fillna(1,inplace=True)

In [14]:
m

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    1.0   1.0
Birmingham      Josef     Baker    1.0   1.0
London           Mike    Brooks  233.0   1.0
Islamabad         Ali      Shah  223.0   1.0
New York         Luke     Brown    1.0   1.0